"""
Телефонен указател

Задачата е да се напишат функции, които работят като телефонен указател.
Телефонният указател трябва да се съхранява във файл.
Телефоните се представят като речник с две полете:
    - `name` - име на човек
    - `phone` - телефоне номер

Например:
    {
        'name': 'Ivan',
        'phone': '0884-35-45-55'
    }


Телефонният указател представлява списък от записи:
    [
        {
            'name': 'Ivan',
            'phone': '0884-35-45-55'
        },
        {
            'name': 'Pesho',
            'phone': '0887-33-44-55'
        }
    ]

Телефонният указател да се съхранява във файл в JSON формат.
"""


def set_phone(filename, name, phone):
    """
    Задава телефонен номер `phone` на човек с име `name`.
    Ако съществува човек с име `name` променя телефона му.
    Ако не съществува - добавя нов запис в телефонния указател.

    Функцията трябва да:
        - прочете указателя от файла с име `filename`
        - модифицаира указателя
        - запише указателя във файла с име `filename`

    Пример:

    >>> set_phone('phonebook.json', 'Ivan', '0895-11-11-11')
    """
    pass


def remove_phone(filename, name):
    """
    Изтрива записа (ако цъществува) за човек с име `name` от телефонния указател.

    Функцията трябва да:
        - прочете указателя от файла с име `filename`
        - модифицаира указателя
        - запише указателя във файла с име `filename`

    Пример:

    >>> remove_phone('phonebook.json', 'Ivan')
    """
    pass


def find_phone(filename, name):
    """
    Намире телефонния номер на човек с име `name`.
    Връща като резултат телефонния номер или `None` ако не го открие.

    Функцията трябва да:
        - прочете указателя от файла с име `filename`
        - потърси и върне телефонния номер

    Пример:

    >>> find_phone('phonebook.json', 'Ivan')
    '0895-11-11-11'
    """
    pass
