# -*- coding: utf-8 -*-

# === Задача 1 ===

def task1():
    n = int(input('n = '))
    # Дефинираме променлова, в който да запазим произведението.
    # За начална стойност на произведението задаваме `1`.
    # Това няма да повлияе на крайния резултат, тъй ката `1 * x = x`.
    product = 1
    # Създаваме брояч, който ще приема стойности от `4` до `n` вклюяително,
    # през `4` и умножаваме стойностите на брояча
    for counter in range(4, n + 1, 4):
        product *= counter
    print('product =', product)


# === Задача 2 ===

def task2():
    n = int(input('n = '))
    # Създаваме брояч на редовете, който ще приема стойности от `0` до `n`
    for row in range(n):
        # Създаваме брояч на колоните,
        # който ще приема стойности от `0` до `n - row`, т. е. ще отпечата
        # `***` `n` пъти за ред `0`, `n - 1` пъти за ред 1, и. т. н
        for col in range(n - row):
            # Отпечатвлме всяка колона, като не отпечатваме символ за край на ред
            print('***', end='')
        # Отпечатвлме символ за край на ред
        print()


print('Task1')
task1()
print('Task2')
task2()
